import { NextResponse } from 'next/server';

export const GET = async (req: Request) => {
    try {
        const data = [
            {
                id: '1',
                name: 'США',
            },
            {
                id: '2',
                name: 'Китай',
            },
            {
                id: '3',
                name: 'Россия',
            },
            {
                id: '4',
                name: 'Индия',
            },
            {
                id: '5',
                name: 'Германия',
            },
            {
                id: '6',
                name: 'Франция',
            },
            {
                id: '7',
                name: 'Бразилия',
            },
            {
                id: '8',
                name: 'Япония',
            },
            {
                id: '9',
                name: 'Австралия',
            },
            {
                id: '10',
                name: 'Канада',
            },
            {
                id: '11',
                name: 'Мексика',
            },
            {
                id: '12',
                name: 'Италия',
            },
            {
                id: '13',
                name: 'Южная Корея',
            },
            {
                id: '14',
                name: 'Великобритания',
            },
            {
                id: '15',
                name: 'Испания',
            },
            {
                id: '16',
                name: 'Аргентина',
            },
            {
                id: '17',
                name: 'Южная Африка',
            },
            {
                id: '18',
                name: 'Египет',
            },
            {
                id: '19',
                name: 'Турция',
            },
            {
                id: '20',
                name: 'Индонезия',
            },
            {
                id: '21',
                name: 'Нидерланды',
            },
            {
                id: '22',
                name: 'Саудовская Аравия',
            },
            {
                id: '23',
                name: 'Швеция',
            },
            {
                id: '24',
                name: 'Швейцария',
            },
            {
                id: '25',
                name: 'Норвегия',
            },
            {
                id: '26',
                name: 'Дания',
            },
            {
                id: '27',
                name: 'Польша',
            },
            {
                id: '28',
                name: 'Чехия',
            },
            {
                id: '29',
                name: 'Украина',
            },
            {
                id: '30',
                name: 'Беларусь',
            },
            {
                id: '31',
                name: 'Казахстан',
            },
            {
                id: '32',
                name: 'Кыргызстан',
            },
            {
                id: '33',
                name: 'Узбекистан',
            },
            {
                id: '34',
                name: 'Таджикистан',
            },
            {
                id: '35',
                name: 'Азербайджан',
            },
            {
                id: '36',
                name: 'Армения',
            },
            {
                id: '37',
                name: 'Грузия',
            },
            {
                id: '38',
                name: 'Эстония',
            },
            {
                id: '39',
                name: 'Латвия',
            },
            {
                id: '40',
                name: 'Литва',
            },
            {
                id: '41',
                name: 'Финляндия',
            },
            {
                id: '42',
                name: 'Исландия',
            },
            {
                id: '43',
                name: 'Ирландия',
            },
            {
                id: '44',
                name: 'Португалия',
            },
            {
                id: '45',
                name: 'Греция',
            },
            {
                id: '46',
                name: 'Австрия',
            },
            {
                id: '47',
                name: 'Венгрия',
            },
            {
                id: '48',
                name: 'Бельгия',
            },
            {
                id: '49',
                name: 'Люксембург',
            },
            {
                id: '50',
                name: 'Словакия',
            },
            {
                id: '51',
                name: 'Хорватия',
            },
            {
                id: '52',
                name: 'Словения',
            },
            {
                id: '53',
                name: 'Болгария',
            },
            {
                id: '54',
                name: 'Румыния',
            },
            {
                id: '55',
                name: 'Молдова',
            },
            {
                id: '56',
                name: 'Сербия',
            },
            {
                id: '57',
                name: 'Черногория',
            },
            {
                id: '58',
                name: 'Македония',
            },
            {
                id: '59',
                name: 'Албания',
            },
            {
                id: '60',
                name: 'Босния и Герцеговина',
            },
        ];
        return NextResponse.json(data, { status: 200 });
    } catch (err) {
        return NextResponse.json({ message: err }, { status: 500 });
    }
};
